Repository: CaptainCucumber/EpicTalesBot
Catalog: bot/locales/*/LC_MESSAGES/*.po
Languages: ru

source: ARTICLE_SUMMARY_PROMPT
ru: Подготовьте краткое резюме предоставленной статьи, которое может быть на любом языке, в лаконичном стиле Axios, используя форматирование указаное ниже. Резюме должно быть на русском языке, содержать менее 250 слов, следовать перечисленным ниже правилам и содержать только резюме статьи без дополнительной коммуникации: 1. Структура списка: Структурируйте основное содержание в виде списка, где каждый элемент передает полную мысль или факт, начиная с соответствующего эмодзи. 2. Краткость и ясность: Фразы должны быть короткими и понятными, без сложных конструкций. 3. Выделение ключевых моментов: Выделяйте наиболее важные факты или утверждения жирным шрифтом (<b>текст</b>). 4. Короткие абзацы: Ограничьте абзацы 1-3 предложениями, каждое из которых сосредоточено на одной идее. 5. Данные и статистика: Ясно представляйте любые данные или статистику отдельно, если это необходимо. 6. Заключительное заявление: Заканчивайте кратким заявлением, всего несколькими предложениями. 7. Нейтральный тон: Используйте информативный и нейтральный тон, избегая специализированного жаргона. 8. Форматирование: Применяйте следующий синтаксис форматирования, такой как <b>жирный</b>, <i>курсив</i>, и <s>зачеркнутый</s>. Вот статья для резюмирования:

source: Title
ru: Название

source: Text
ru: Текст

source: Sorry, I couldn't generate the article summary.
ru: Извините, мне не удалось сгенерировать резюме статьи.

source: VIDEO_SUMMARY_PROMPT
ru: Подготовьте краткое резюме предоставленного видео, которое может быть на любом языке, в лаконичном стиле Axios. Резюме должно быть на русском языке, содержать менее 120 слов, следовать перечисленным ниже правилам и содержать только резюме видео без дополнительной коммуникации: 1. Структура списка: Структурируйте основное содержание в виде списка, где каждый элемент передает полную мысль или факт, начиная с соответствующего эмодзи. 2. Краткость и ясность: Фразы должны быть короткими и понятными, без сложных конструкций. 3. Выделение ключевых моментов: Выделяйте наиболее важные факты или утверждения жирным шрифтом (<b>текст</b>). 4. Короткие абзацы: Ограничьте абзацы 1-3 предложениями, каждое из которых сосредоточено на одной идее. 5. Данные и статистика: Ясно представляйте любые данные или статистику отдельно, если это необходимо. 6. Заключительное заявление: Заканчивайте кратким заявлением, всего несколькими предложениями. 7. Нейтральный тон: Используйте информативный и нейтральный тон, избегая специализированного жаргона. 8. Форматирование: Применяйте следующий синтаксис для форматирования, такой как <b>жирный</b>, <i>курсив</i>, и <s>зачеркнутый</s>. 9. Ни в коем случае не использовать язык Markdown в ответе. Вот содержание YouTube видео:

source: Subtitles
ru: Субтитры

source: Sorry, I couldn't generate the video summary.
ru: Извините, мне не удалось сгенерировать резюме видео.

source: The video is not available for reviewing
ru: Извините, мне не удалось сгенерировать резюме видео. Видео недоступно для просмотра

source: The subtitles are not available.
ru: Извините, мне не удалось сгенерировать резюме видео. Субтитры недоступны.

source: Welcome message
ru: Вы можете отправить мне ссылку или голосовое сообщение, и я выполню всю остальную работу. Команды: /start - показывает это сообщение /listen - переводит голосовые сообщения /read - читает статьи /watch - просматривает видео /autotranscribe - включает или выключает автоматический перевод голосовых сообщений сообщений /version - показывает текущую версию бота

source: No voice message to transcribe
ru: <i>Нет голосового сообщения для перевода.</i> 🛑

source: No article to summarize
ru: <i>Нет статьи для анализа.</i> 🛑

source: No video to summarize
ru: <i>Нет видео для просмотра.</i> 🛑

source: Auto-transcribe enabled
ru: <i>Авто перевод <b>включен</b></i> ✅

source: Auto-transcribe disabled
ru: <i>Авто перевод <b>выключен</b></i> ❌

source: New settings in tact
ru: ⚠️ Внимание! Мы обновили функционал нашего бота. Теперь вместо упоминаний, у бота есть четыре команды: /listen - переводит голосовые сообщения /read - читает статьи /watch - просматривает видео Если хотите, чтобы бот автоматически переводил все голосовые сообщения, используйте команду /autotranscribe. Эта команда включает или выключает автоматический перевод сообщений для вашего чата.
